Repository: common-repository/world-flags
Catalog: languages/world_flags-*.po
Languages: fa_ir

source: World Flags
fa_ir: پرچم‌های جهان

source: IP list successfully downloaded but zero rows inserted into database.
fa_ir: فهرست IPها با موفقیت دریافت شد ولی هیچ موردی به بانک اطلاعاتی افزوده نشد.

source: Failed to download and save the database. Please try again.
fa_ir: دریافت و ذخیره بانک اطلاعاتی با خطا مواجه شد. لطفا دوباره تلاش کنید.

source: World Flags Options
fa_ir: گزینه‌های پرچم‌های جهان

source: Use this form to change options for the World Flags plugin, or fetch the latest IP database manually.
fa_ir: از این صفحه برای تغییر گزینه های افزونه و یا دریافت دستی آخرین بانک اطلاعات IPها استفاده کنید.

source: General
fa_ir: عمومی

source: Insert Method
fa_ir: شیوه درج

source: Normal (Simply includes HTML. This maynot work if you have caching enabled on your site)
fa_ir: عادی (درج ساده HTML. اگر از Cache استفاده می‌کنید این گزینه به خوبی عمل نخواهدکرد.)

source: Script (Writes the HTML using a tiny javascript)
fa_ir: اسکریپت (HTML را با کد کوچکی از جاوا می‌نویسد)

source: jQuery (Neat way to insert the HTML, but jQuery library will also be included. If you have it already, then this is the best choice. <strong>If you have caching, this is the option for you!</strong>)
fa_ir: jQuery (روشی زیبا برای درج HTML، ولی jQuery را نیز درصورت نیاز به سایت شما می‌افزاید. <strong>اگر از کش استفاده می‌کنید این گزینه را انتخاب کنید!</strong>)

source: Options for the World Flag in comments
fa_ir: گزینه‌های تابع پرچم‌های جهان در دیدگاه‌ها

source: Visitor Comments
fa_ir: دیدگاه‌های بازدیدکنندگان

source: Enable inserting country flag based on comment author IP address
fa_ir: فعال‌سازی درج پرچم کشور در دیدگاه‌ها براساس IP نویسنده

source: Size
fa_ir: اندازه

source: Icon - 16
fa_ir: آیکون - 16

source: Small - 24
fa_ir: کوچک - 24

source: Medium - 32
fa_ir: متوسط - 32

source: Large - 48
fa_ir: بزرگ - 48

source: Country Name
fa_ir: نام کشور

source: Include the country name beside the flag image
fa_ir: نام کشور را هم در کنار عکس پرچم بیاور

source: Exclude Admin
fa_ir: صرف‌نظر از مدیرسایت

source: Exclude admin <code>user_id= 1</code> comments when showing flags
fa_ir: در نظر نگرفتن مدیرسایت <code>user_id= 1</code> هنگام نمایش پرچم‌ها در دیدگاه‌ها

source: Comments Insert Method
fa_ir: شیوه درج در دیدگاه‌ها

source: Before Comment Text (Adds the flag HTML before the visitor comment text)
fa_ir: قبل از متن دیدگاه (HTML را قبل از متن دیدگاه درج می‌کند)

source: After Comment Text (Adds the flag HTML after the visitor comment text)
fa_ir: بعد از متن دیدگاه (HTML را بعد از متن دیدگاه درج می‌کند)

source: Manual (If you have hooked the comments loop in your template you can select this option and use <code>&lt;?php if (function_exists("world_flags_comment_flag")) world_flags_comment_flag($comment); ?&gt;</code>)
fa_ir: دستی (اگر حلقه دیدگاه‌ها در پوسته شما تعریف شده است می‌توانید این گزینه را انتخاب کنید و از این تابع استفاده کنید <code>&lt;?php if (function_exists("world_flags_comment_flag")) echo world_flags_comment_flag($comment); ?&gt;</code>)

source: Prepend Text
fa_ir: متن پیش از درج

source: Optional text to add before the flag HTML
fa_ir: متن دلخواه که پیش از درج HTML پرچم می آید

source: Append Text
fa_ir: متن پس از درج

source: Optional text to add after the flag HTML
fa_ir: متن دلخواه که پس از درج HTML پرچم می آید

source: Options for the World Flag function in your template
fa_ir: گزینه‌های تابع پرچم‌های جهان در پوسته شما

source: You can include World Flag in your template by inserting <code>&lt;?php if (function_exists("world_flags_insert_flag")) world_flags_insert_flag(); ?&gt;</code>
fa_ir: شما می‌توانید پرچم‌های جهان را در هر کجای پوسته خود با این تابع داشته باشید <code>&lt;?php if (function_exists("world_flags_insert_flag")) world_flags_insert_flag(); ?&gt;</code>

source: IP Database
fa_ir: بانک اطلاعات IP

source: Scheduled Updates
fa_ir: برنامه‌ریزی به‌روزرسانی

source: Enable weekly automatic fetching of the database
fa_ir: فعال‌سازی دریافت خودکار هفتگی بانک اطلاعاتی

source: Update IP Database
fa_ir: به‌روزرسانی بانک اطلاعات IP

source: Manually Fetch
fa_ir: دریافت دستی

source: Update Database Now!
fa_ir: بانک اطلاعاتی را به‌روزرسانی کن!

source: This may take some time. Please be patient!
fa_ir: این عمل مدتی زمان می‌برد. لطفا صبور باشید!

source: Do not use this button often. Once a week or even once a month should work if you have disabled the scheduled download. Please be aware that software77.net may ban your IP if you send many download requrests. Refer to the policy on their website for more information.
fa_ir: از این کلید در فواصل کوتاه استفاده نکنید. یک بار در هفته یا حتی یک بار در ماه کافی است اگر گزینه دریافت خودکار را غیرفعال کرده‌اید. لطفا دقت کنید که سایت software77.net ممکن است دسترسی IP شما را درصورتی که درخواست‌های زیاد بفرستید غیرفعال کند. به قوانین این وب‌سایت برای اطلاعات بیشتر رجوع کنید.

source: You must download the IP database for the automatic mode to work properly. Go to <a href="%s">World Flags Options</a> and manually fetch the database.
fa_ir: شما باید بانک اطلاعات IP را دریافت کنید تا حالت خودکار به درستی کار کند. به <a href="%s">گزینه‌های پرچم‌های جهان</a> بروید و بانک را به صورت دستی دریافت کنید.

source: Invalid Country Code
fa_ir: کد کشور معتبر نیست

source: Show visitor country based on IP
fa_ir: نمایش کشور بازدیدکننده براساس IP

source: Title:
fa_ir: عنوان:

source: Country Code:
fa_ir: کد کشور:

source: Automatic, Visitor IP
fa_ir: خودکار، IP بازدیدکننده

source: Size:
fa_ir: اندازه:
